cask_args appdir: '/Applications'

# devtools
brew 'awscli'
brew 'awslogs'
brew 'bat'
brew 'ctags'
brew 'fd'
tap 'homebrew/cask-fonts'
brew 'font-symbols-only-nerd-font'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'jq'
brew 'neovim'
brew 'nnn'
brew 'nodejs'
brew 'postgresql@16'
brew 'python3'
brew 'ripgrep'
brew 'tig'
brew 'wget'
brew 'yarn'
brew 'ykman'

# apps
cask 'acorn'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'kaleidoscope'
cask 'launchbar'
cask 'sublime-text'
