cask_args appdir: '/Applications'

# devtools
brew 'ag'
brew 'awscli'
brew 'awslogs'
brew 'bat'
brew 'ctags'
tap 'lucagrulla/tap'
brew 'cw'
brew 'direnv'
brew 'fd'
brew 'fzf'
brew 'git'
tap 'git-duet/tap'
brew 'git-duet'
brew 'imagemagick'
brew 'jq'
brew 'neovim'
brew 'nnn'
brew 'nodejs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'redis'
brew 'ripgrep'
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'ykman'

# apps
cask 'acorn'
cask 'aws-vault'
cask 'charles'
cask 'chromedriver'
cask 'docker'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'launchbar'
cask 'ngrok'
cask 'paw'
cask 'slack'
cask 'sublime-text'
cask 'zoomus'
