cask_args appdir: '/Applications'

# devtools
brew 'awscli'
brew 'awslogs'
brew 'bat'
brew 'chromedriver'
brew 'ctags'
brew 'datasette'
brew 'exiftool'
brew 'fclones'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gifsicle'
brew 'git'
brew 'imagemagick'
brew 'jq'
brew 'lazygit'
brew 'n'
brew 'neovim'
brew 'nodejs'
brew 'postgresql@16'
brew 'python3'
brew 'ripgrep'
brew 'sqlite'
brew 'sqlite-utils'
brew 'tig'
brew 'wget'
brew 'xsv'
brew 'yarn'
brew 'ykman'
brew 'yt-dlp'

# apps
cask 'acorn'
cask 'firefox'
tap 'homebrew/cask-fonts'
cask 'font-symbols-only-nerd-font'
cask 'gitup'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'kaleidoscope'
cask 'launchbar'
cask 'slack'
cask 'sublime-text'
